{"class_name": "Sequential", "config": {"name": "MLP", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}}, {"class_name": "PruneLowMagnitude", "config": {"name": "prune_low_magnitude_dense", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 8, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, "pruning_schedule": {"class_name": "PolynomialDecay", "config": {"initial_sparsity": 0.0, "final_sparsity": 0.5, "power": 3, "begin_step": 2000, "end_step": 4000, "frequency": 100}}, "block_size": [1, 1], "block_pooling_type": "AVG"}}, {"class_name": "PruneLowMagnitude", "config": {"name": "prune_low_magnitude_dense_1", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, "pruning_schedule": {"class_name": "PolynomialDecay", "config": {"initial_sparsity": 0.0, "final_sparsity": 0.5, "power": 3, "begin_step": 2000, "end_step": 4000, "frequency": 100}}, "block_size": [1, 1], "block_pooling_type": "AVG"}}, {"class_name": "PruneLowMagnitude", "config": {"name": "prune_low_magnitude_dense_2", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 8, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, "pruning_schedule": {"class_name": "PolynomialDecay", "config": {"initial_sparsity": 0.0, "final_sparsity": 0.5, "power": 3, "begin_step": 2000, "end_step": 4000, "frequency": 100}}, "block_size": [1, 1], "block_pooling_type": "AVG"}}, {"class_name": "PruneLowMagnitude", "config": {"name": "prune_low_magnitude_dense_3", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 8, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, "pruning_schedule": {"class_name": "PolynomialDecay", "config": {"initial_sparsity": 0.0, "final_sparsity": 0.5, "power": 3, "begin_step": 2000, "end_step": 4000, "frequency": 100}}, "block_size": [1, 1], "block_pooling_type": "AVG"}}, {"class_name": "PruneLowMagnitude", "config": {"name": "prune_low_magnitude_dense_4", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 3, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, "pruning_schedule": {"class_name": "PolynomialDecay", "config": {"initial_sparsity": 0.0, "final_sparsity": 0.5, "power": 3, "begin_step": 2000, "end_step": 4000, "frequency": 100}}, "block_size": [1, 1], "block_pooling_type": "AVG"}}]}, "keras_version": "2.9.0", "backend": "tensorflow"}